<div class="education-pgdoc">
    В России обучение в аспирантуре, как правило, продолжается в течение 3 лет (при заочной форме — четырёх). Для поступления необходимо иметь квалификацию специалиста или магистра, получить согласие будущего научного руководителя и сдать 3 экзамена (специальность, иностранный язык, философия науки).
    <br><br>
    В некоторых университетах магистрам, при наличии в учебном плане соответствующего числа часов, могут перезачесть педагогическую практику, вступительные экзамены по ИЯ и философии, а также и кандидатский минимум по ИЯ и ИФН.
    <br><br>
    После успешного окончания аспирантуры и защиты кандидатской диссертации в диссертационном совете, аспирант становится кандидатом наук и может продолжить обучение вдокторантуре. В некоторых европейских странах терминам аспирант и аспирантура соответствуют докторант и докторантура.
    <br><br>
</div>