<div class="education-index">
    <p>Профессорско-преподавательский состав кафедры ведет подготовку:</p>
    <br>
    <p>Бакалавров по направлению 230100 "Информатика и вычислительная техника"</p>
    <p>Инженеров по специальности 230105 "Программное обеспечение вычислительной техники и автоматизированных систем"</p>
    <p>Магистров по направлению 230105 "Программное обеспечение вычислительной техники и автоматизированных систем"</p>
    <p>Аспирантов по специальности 230105 "Программное обеспечение вычислительной техники и автоматизированных систем"</p>
    <br>
    <p>По окончании образовательной программы по данной специальности инженер-программист приобретает квалификационные умения для участия во всех фазах проектирования, разработки, изготовления и сопровождения программ и программной документации; использования современных методов, средств и технологии разработки программного обеспечения; участия в проведении научных исследований и выполнения технических разработок в своей профессиональной области; осуществления сбора, обработки, анализа и систематизации научно-технической информации по заданной теме с применением современных технологий; для взаимодействия со специалистами смежного профиля и кооперации с коллегами, работы в коллективе, управления и организации работы исполнителей в процессе производства программных продуктов; для анализа своих возможностей, переоценки накопленного опыта и приобретения новых знаний.</p>
    <br>
    <p>Предусмотрены следующие формы обучения:</p>
    <br>
    Дневное
    <br>
    Вечернее
</div>