<div class="scientific-index">
    Кафедра принимает активное участие в научной работе и в пропаганде знаний в области современных информационных технологий. За период с 1996 по настоящее время кафедра принимала участие в организации нескольких выставок научно-технического творчества ВолгГТУ, ежегодных специализированных выставках Министерства образования РФ, Москва, ВВЦ. (подготовлено несколько компакт-дисков с информацией о научной работе кафедры по направлениям : аппаратурно-ориентированные алгоритмы и структуры на их основе, моделирование сетей передачи данных, системы биометрической аутентификации), в организации международных научно-технических конференциях "Информационные технологии в образовании, технике и медицине", проводившихся в ВолгГТУ в 2000, 2002, 2004, 2006 и 2009 годах.
    <br><br>
    Преподаватели и сотрудники кафедры постоянно принимают участие в ежегодных международных и всеросийских конференциях: Международная конференция "Информационные технологии в науке, ообразовании, телекоммуникации и бизнесе", Украина, Ялта - Гурзуф.Международная научно-техническая конференция "Системные проблемы качества математического моделирования, информационных и электронных технологий", Москва - Сочи.Всероссийская научная конференция "Проблемы информационной безопасности в системе высшей школы", Москва, МИФИ.Всероссийская научная конференция "Инновационные технологии в управлении, образовании, промышленности "АСТИНТЕХ", Астрахань, АГУ.
    <br><br>
    Международная научно-практическая конференция "Информационная безопасность. Интеллектуальные системы защиты информации XXI века", Таганрог, ЮФУ.Международная научно-практическая конференция "Телематика", Санкт-Петербург.
    <br><br>
    Сотрудники, аспиранты и студенты кафедры принимают участие в ежегодно проводимых региональных конференциях:
    <br><br>
    Региональной конференции молодых исследователей Волгоградской области;
    <br><br>
    Межвузовской конференции студентов и молодых ученых г. Волжского (Волжский политехнический институт);
    <br><br>
    Региональная научно-практическая студенческая конференция (г. Камышин, КТИ);
    <br>
    Научная инициатива иностранных студентов и аспирантов в российских вузах (г. Томск, ТПУ).
</div>