<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');
/*
| -------------------------------------------------------------------
| Foreign Characters
| -------------------------------------------------------------------
| This file contains an array of foreign characters for transliteration
| conversion used by the Text helper
|
*/
$foreign_characters = array(
	'/А/'=>'A',
	'/Б/'=>'B',
	'/В/'=>'V',
	'/Г/'=>'G',
	'/Д/'=>'D',
	"/Е|Ё/"=>'E',
	'/Ж/'=>'J',
	'/З/'=>'Z',
	'/И/'=>'I',
	'/Й/'=>'Y',
	'/К/'=>'K',
	'/Л/'=>'L',
	'/М/'=>'M',
	'/Н/'=>'N',
	'/О/'=>'O',
	'/П/'=>'P',
	'/Р/'=>'R',
	'/С/'=>'S',
	'/Т/'=>'T',
	'/У/'=>'U',
	'/Ф/'=>'F',
	'/Х/'=>'H',
	'/Ц/'=>'TS',
	'/Ч/'=>'CH',
	'/Ш/'=>'SH',
	'/Щ/'=>'SCH',
	'/Ъ/'=>'I',
	'/Ы/'=>'Y',
	'/Ь/'=>'',
	'/Э/'=>'E',
	'/Ю/'=>'YU',
	'/Я/'=>'YA',
	'/а/'=>'a',
	'/б/'=>'b',
	'/в/'=>'v',
	'/г/'=>'g',
	'/д/'=>'d',
	'/е|ё/'=>'e',
	'/ж/'=>'j',
	'/з/'=>'z',
	'/и/'=>'i',
	'/й/'=>'y',
	'/к/'=>'k',
	'/л/'=>'l',
	'/м/'=>'m',
	'/н/'=>'n',
	'/о/'=>'o',
	'/п/'=>'p',
	'/р/'=>'r',
	'/с/'=>'s',
	'/т/'=>'t',
	'/у/'=>'u',
	'/ф/'=>'f',
	'/х/'=>'h',
	'/ц/'=>'ts',
	'/ч/'=>'ch',
	'/ш/'=>'sh',
	'/щ/'=>'sсh',
	'/ъ/'=>'',
	'/ы/'=>'y',
	'/ь/'=>'i',
	'/э/'=>'e',
	'/ю/'=>'yu',
	'/я/'=>'ya'
);

/* End of file foreign_chars.php */
/* Location: ./application/config/foreign_chars.php */